nxp-mcuxpresso/mcux-soc-svd/MCXW727D/MCXW727D_cm33_core1.xml
        <register>
          <name>RX_FRAME_FILTER</name>
          <description>RECEIVE FRAME FILTER</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x60F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BEACON_FT</name>
              <description>Beacon Frame Type Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEACON_FT_0</name>
                  <description>reject all Beacon frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEACON_FT_1</name>
                  <description>Beacon frame type enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_FT</name>
              <description>Data Frame Type Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_FT_0</name>
                  <description>reject all Beacon frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_FT_1</name>
                  <description>Data frame type enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACK_FT</name>
              <description>Ack Frame Type Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK_FT_0</name>
                  <description>reject all Acknowledge frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_FT_1</name>
                  <description>Acknowledge frame type enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD_FT</name>
              <description>MAC Command Frame Type Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_FT_0</name>
                  <description>reject all MAC Command frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_FT_1</name>
                  <description>MAC Command frame type enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LLDN_FT</name>
              <description>LLDN Frame Type Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LLDN_FT_0</name>
                  <description>reject all LLDN frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LLDN_FT_1</name>
                  <description>LLDN frame type enabled (Frame Type 4).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTIPURPOSE_FT</name>
              <description>Multipurpose Frame Type Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTIPURPOSE_FT_0</name>
                  <description>reject all Multipurpose frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPURPOSE_FT_1</name>
                  <description>Multipurpose frame type enabled (Frame Type 5).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAGMENT_FT</name>
              <description>Fragment Frame Type Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAGMENT_FT_0</name>
                  <description>reject all Fragment frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAGMENT_FT_1</name>
                  <description>Fragment frame type enabled (Frame Type 6).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTENDED_FT</name>
              <description>Extended Frame Type Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTENDED_FT_0</name>
                  <description>reject all Extended frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED_FT_1</name>
                  <description>Extended frame type enabled (Frame Type 7).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NS_FT</name>
              <description>&quot;Not Specified&quot; Frame Type Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NS_FT_0</name>
                  <description>reject all &quot;Not Specified&quot; frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS_FT_1</name>
                  <description>Not-specified (reserved) frame type enabled. Applies to Frame Type 6. No packet filtering is performed, except for frame length checking (FrameLength&gt;=5 and FrameLength&lt;=127). No AUTOACK is transmitted for this Frame Type</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRM_VER_FILTER</name>
              <description>Frame Version selector.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTENDED_FCS_CHK</name>
              <description>Verify FCS on Frame Type Extended</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTENDED_FCS_CHK_0</name>
                  <description>Packet Processor will not check FCS for Frame Type EXTENDED (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED_FCS_CHK_1</name>
                  <description>Packet Processor will check FCS at end-of-packet based on packet length derived from PHR, for Frame Type EXTENDED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FV2_BEACON_RECD</name>
              <description>Frame Version 2 Beacon Packet Received</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FV2_BEACON_RECD_0</name>
                  <description>The last packet received was not Frame Type Beacon with Frame Version 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FV2_BEACON_RECD_1</name>
                  <description>The last packet received was Frame Type Beacon with Frame Version 2, and FRM_VER_FILTER[2]=1 to allow such packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FV2_DATA_RECD</name>
              <description>Frame Version 2 Data Packet Received</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FV2_DATA_RECD_0</name>
                  <description>The last packet received was not Frame Type Data with Frame Version 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FV2_DATA_RECD_1</name>
                  <description>The last packet received was Frame Type Data with Frame Version 2, and FRM_VER_FILTER[2]=1 to allow such packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FV2_ACK_RECD</name>
              <description>Frame Version 2 Acknowledge Packet Received</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FV2_ACK_RECD_0</name>
                  <description>The last packet received was not Frame Type Ack with Frame Version 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FV2_ACK_RECD_1</name>
                  <description>The last packet received was Frame Type Ack with Frame Version 2, and FRM_VER_FILTER[2]=1 to allow such packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FV2_CMD_RECD</name>
              <description>Frame Version 2 MAC Command Packet Received</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FV2_CMD_RECD_0</name>
                  <description>The last packet received was not Frame Type MAC Command with Frame Version 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FV2_CMD_RECD_1</name>
                  <description>The last packet received was Frame Type MAC Command with Frame Version 2, and FRM_VER_FILTER[2]=1 to allow such packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LLDN_RECD</name>
              <description>LLDN Packet Received</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LLDN_RECD_0</name>
                  <description>The last packet received was not Frame Type LLDN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LLDN_RECD_1</name>
                  <description>The last packet received was Frame Type LLDN, and LLDN_FT=1 to allow such packets.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTIPURPOSE_RECD</name>
              <description>Multipurpose Packet Received</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTIPURPOSE_RECD_0</name>
                  <description>last packet received was not Frame Type MULTIPURPOSE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPURPOSE_RECD_1</name>
                  <description>The last packet received was Frame Type MULTIPURPOSE, and MULTIPURPOSE_FT=1 to allow such packets.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAGMENT_RECD</name>
              <description>Fragment Packet Received</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAGMENT_RECD_0</name>
                  <description>last packet received was not Frame Type FRAGMENT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAGMENT_RECD_1</name>
                  <description>The last packet received was Frame Type FRAGMENT, and FRAGMENT_FT=1 to allow such packets.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTENDED_RECD</name>
              <description>Extended Packet Received</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTENDED_RECD_0</name>
                  <description>The last packet received was not Frame Type EXTENDED</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED_RECD_1</name>
                  <description>The last packet received was Frame Type EXTENDED, and EXTENDED_FT=1 to allow such packets.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXCYC_SEL</name>
              <description>Rx Recycle Time Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXCYC_SEL_0</name>
                  <description>Recycle when fail happens.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXCYC_SEL_1</name>
                  <description>Recycle when Rx done and fail happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTER_FAIL_IGNORE</name>
              <description>Filter Fail Ignore</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTER_FAIL_IGNORE_0</name>
                  <description>RX_IRQ will not be asserted when filter fail.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_FAIL_IGNORE_1</name>
                  <description>RX_IRQ will be asserted when filter fail.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROMISCUOUS</name>
              <description>Promiscuous Mode Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROMISCUOUS_0</name>
                  <description>normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROMISCUOUS_1</name>
                  <description>all packet filtering except frame length checking (FrameLength&gt;=5) is bypassed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENH_PKT_STATUS</name>
              <description>Enhanced Packet Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENH_PKT_STATUS_0</name>
                  <description>The last packet received was not 2015-compliant</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENH_PKT_STATUS_1</name>
                  <description>The last packet received was 2015-compliant (RX_FRAME_FILTER register should be queried for additional status bits)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTERFAIL_CODE</name>
          <description>FILTER FAIL CODE</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILTERFAIL_CODE_PAN</name>
              <description>Filter Fail Code When in PAN Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FILTERFAIL_CODE_FAN</name>
              <description>Filter Fail Code When in FAN Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FILTERFAIL_PAN_SEL</name>
              <description>PAN Selector for Filter Fail Code</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTERFAIL_PAN_SEL_0</name>
                  <description>FILTERFAIL_CODE_PAN/FILTERFAIL_CODE_FAN will report the FILTERFAIL status of PAN0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTERFAIL_PAN_SEL_1</name>
                  <description>FILTERFAIL_CODE_PAN/FILTERFAIL_CODE_FAN will report the FILTERFAIL status of PAN1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTERFAIL_FLAG_SEL</name>
              <description>Consolidated Filter Fail Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LENIENCY_LSB</name>
          <description>LENIENCY LSB</description>
          <alternateGroup>LENIENCY_LSB</alternateGroup>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LENIENCY_LSB</name>
              <description>Leniency LSB Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
