nxp-mcuxpresso/mcux-soc-svd/MCXW727D/MCXW727D_cm33_core1.xml
        <register>
          <name>CHANNEL_NUM1</name>
          <description>CHANNEL NUMBER 1</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_NUM1</name>
              <description>Channel Number for PAN1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSHORTADDRS0</name>
          <description>MAC SHORT ADDRESS 0</description>
          <alternateGroup>MACSHORTADDRS0</alternateGroup>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACPANID0</name>
              <description>MAC PAN ID for PAN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MACSHORTADDRS0</name>
              <description>MAC SHORT ADDRESS FOR PAN0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WL_VALID_ENTRY0</name>
          <description>VALID ENTRY OF WHITE LIST 0</description>
          <alternateGroup>WL_VALID_ENTRY0</alternateGroup>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_VALID_ENTRY0</name>
              <description>Here bits [31:0] corresponds to validity of 32th to 1st entry in white list 0 respectively</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTM_FIRST_SFD2WD</name>
          <description>GTM MODE TIME OF FIRST SFD FOUND TO FORCE RX WARM-DOWN</description>
          <alternateGroup>GTM_FIRST_SFD2WD</alternateGroup>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTM_FIRST_SFD2WD</name>
              <description>GTM MODE TIME OF FIRST SFD FOUND TO FORCE RX WARMDOWN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS0_LSB</name>
          <description>MAC LONG ADDRESS 0 LSB</description>
          <alternateGroup>MACLONGADDRS0_LSB</alternateGroup>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS0_LSB</name>
              <description>MAC LONG ADDRESS for PAN0 LSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WL_SEARCH_ADDR_LSB</name>
          <description>WL_SEARCH_ADDR[31:0]</description>
          <alternateGroup>WL_SEARCH_ADDR_LSB</alternateGroup>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_SEARCH_ADDR_LSB</name>
              <description>Lower 32 bit of 48-bit address to be searched in white list.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTM_RX_RECYCLE_TIME</name>
          <description>GTM MODE RX RECYCLE TIME</description>
          <alternateGroup>GTM_RX_RECYCLE_TIME</alternateGroup>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTM_RX_RECYCLE_TIME</name>
              <description>GTM MODE RX RECYCLE TIME</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS0_MSB</name>
          <description>MAC LONG ADDRESS 0 MSB</description>
          <alternateGroup>MACLONGADDRS0_MSB</alternateGroup>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS0_MSB</name>
              <description>MAC LONG ADDRESS for PAN0 MSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WL_SEARCH_ADDR_MSB</name>
          <description>WL_SEARCH_ADDR[47:32]</description>
          <alternateGroup>WL_SEARCH_ADDR_MSB</alternateGroup>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_SEARCH_ADDR_MSB</name>
              <description>Higher 16 bit of 48-bit address to be searched in white list.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WL_SEARCH_ADDR_TYPE</name>
              <description>no description available</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>The address type is public.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>The address type is random.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA_LQI_CTRL</name>
          <description>CCA AND LQI CONTROL</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4B00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCABFRTX</name>
              <description>CCA Before TX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCABFRTX_0</name>
                  <description>no CCA required, transmit operation begins immediately.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCABFRTX_1</name>
                  <description>at least one CCA measurement is required prior to the transmit operation (see also SLOTTED).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIMUL_CCA_RX</name>
              <description>Simultaneous CCA and Receive Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIMUL_CCA_RX_0</name>
                  <description>Packets can't be received during CCA measurement</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIMUL_CCA_RX_1</name>
                  <description>Packet reception is enabled during CCA measurement if preamble and SFD are detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA</name>
              <description>CCA Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA_0</name>
                  <description>IDLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_1</name>
                  <description>BUSY</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA1_THRESH</name>
              <description>CCA Mode 1 Threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA1_ED_FNL</name>
              <description>Final Result for CCA Mode 1 and Energy Detect</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WARMUP_TIME</name>
          <description>TX/RX WARMUP TIME</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x70005A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_WARMUP</name>
              <description>Receive Warmup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_WARMUP</name>
              <description>Transmit Warmup Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXEN_DLY</name>
          <description>RX_EN Delay Time</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXEN_DLY</name>
              <description>When RXEN_DLY is not zero, the RX_EN signal will delay (RXEN_DLY +1) microseconds to de-assert after packet is received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXEN_DLY_OVERRIDE</name>
              <description>RX_EN delay to de-assert time override enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXEN_DLY_OVERRIDE_0</name>
                  <description>For Bluetooth LE case, RX_EN signal will delay to de-assert according to the length of TERM2 or CTE(when BLE_V5P1_CTE_EN is enabled) field parsed by hardware</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXEN_DLY_OVERRIDE_1</name>
                  <description>For all receive case, RX_EN signal will delay to de-assert according to register RXEN_DLY[9:0].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_CTRL</name>
          <description>SAM CONTROL</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80804000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAP0_EN</name>
              <description>Enables SAP0 Partition of the SAM Table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAP0_EN_0</name>
                  <description>Disables SAP0 Partition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAP0_EN_1</name>
                  <description>Enables SAP0 Partition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAA0_EN</name>
              <description>Enables SAA0 Partition of the SAM Table</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAA0_EN_0</name>
                  <description>Disables SAA0 Partition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAA0_EN_1</name>
                  <description>Enables SAA0 Partition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAP1_EN</name>
              <description>Enables SAP1 Partition of the SAM Table</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAP1_EN_0</name>
                  <description>Disables SAP1 Partition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAP1_EN_1</name>
                  <description>Enables SAP1 Partition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAA1_EN</name>
              <description>Enables SAA1 Partition of the SAM Table</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAA1_EN_0</name>
                  <description>Disables SAA1 Partition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAA1_EN_1</name>
                  <description>Enables SAA1 Partition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAA0_START</name>
              <description>First Index of SAA0 partition</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAP1_START</name>
              <description>First Index of SAP1 partition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAA1_START</name>
              <description>First Index of SAA1 partition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_TABLE</name>
          <description>SOURCE ADDRESS MANAGEMENT TABLE</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAM_INDEX</name>
              <description>Contains the SAM table index to be enabled or invalidated</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAM_INDEX_WR</name>
              <description>Enables SAM Table Contents to be updated</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAM_CHECKSUM</name>
              <description>Software-computed source address checksum, to be installed into a table index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAM_INDEX_INV</name>
              <description>Invalidate the SAM table index selected by SAM_INDEX</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAM_INDEX_EN</name>
              <description>Enable the SAM table index selected by SAM_INDEX</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACK_FRM_PND</name>
              <description>State of AutoTxAck FramePending field when SAM Acceleration is Disabled</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK_FRM_PND_CTRL</name>
              <description>Manual Control for AutoTxAck FramePending field</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK_FRM_PND_CTRL_0</name>
                  <description>the FramePending field of the Frame Control Field of the next automatic TX acknowledge packet is determined by hardware</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_FRM_PND_CTRL_1</name>
                  <description>the FramePending field of the Frame Control Field of the next automatic TX acknowledge packet tracks ACK_FRM_PEND</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIND_FREE_IDX</name>
              <description>Find First Free Index</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INVALIDATE_ALL</name>
              <description>Invalidate Entire SAM Table</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SRCADDR</name>
              <description>Source Address Match Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAM_BUSY</name>
              <description>SAM Table Update Status Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
