nxp-mcuxpresso/mcux-soc-svd/MCXW727D/MCXW727D_cm33_core1.xml
        <register>
          <name>CRS7</name>
          <description>Control Register</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARK</name>
              <description>Park</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>initiator_port_0</name>
                  <description>Park on initiator port M0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_1</name>
                  <description>Park on initiator port M1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_2</name>
                  <description>Park on initiator port M2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_3</name>
                  <description>Park on initiator port M3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_4</name>
                  <description>Park on initiator port M4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_5</name>
                  <description>Park on initiator port M5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_6</name>
                  <description>Park on initiator port M6.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>initiator_port_7</name>
                  <description>Park on initiator port M7.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCTL</name>
              <description>Parking Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>park</name>
                  <description>When no initiator makes a request, the arbiter parks the target port on the initiator port defined by the PARK field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>target_port</name>
                  <description>When no initiator makes a request, the arbiter parks the target port on the last initiator to be in control of the target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>safe_state</name>
                  <description>When no initiator makes a request, the target port is not parked on a initiator and the arbiter drives all outputs to a constant safe state.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB</name>
              <description>Arbitration Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Fixed priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RR</name>
                  <description>Round-robin(RR) or rotating priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HLP</name>
              <description>Halt Low Priority</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPMH</name>
                  <description>The low-power mode request has the highest priority for arbitration on this target port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPML</name>
                  <description>The low-power mode request has the lowest initial priority for arbitration on this target port.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RO</name>
              <description>Read Only</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>writeable</name>
                  <description>The target port's registers are writeable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bus_err</name>
                  <description>The target port's registers are read-only and cannot be written. Attempted writes do not affect the registers and result in a bus error response.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR0</name>
          <description>Initiator General Purpose Control Register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB1</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB2</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB3</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB4</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB5</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR1</name>
          <description>Initiator General Purpose Control Register</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB1</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB2</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB3</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB4</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB5</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR2</name>
          <description>Initiator General Purpose Control Register</description>
          <addressOffset>0xA00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB1</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB2</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB3</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB4</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB5</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR3</name>
          <description>Initiator General Purpose Control Register</description>
          <addressOffset>0xB00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB1</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB2</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB3</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB4</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB5</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR4</name>
          <description>Initiator General Purpose Control Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB1</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB2</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB3</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB4</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB5</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR5</name>
          <description>Initiator General Purpose Control Register</description>
          <addressOffset>0xD00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB1</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB2</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB3</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB4</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB5</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MGPCR6</name>
          <description>Initiator General Purpose Control Register</description>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AULB</name>
              <description>Arbitrates On Undefined Length Bursts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AULB1</name>
                  <description>No arbitration is allowed during an undefined length burst.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB2</name>
                  <description>Arbitration is allowed at any time during an undefined length burst.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB3</name>
                  <description>Arbitration is allowed after four beats of an undefined length burst.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB4</name>
                  <description>Arbitration is allowed after eight beats of an undefined length burst.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AULB5</name>
                  <description>Arbitration is allowed after 16 beats of an undefined length burst.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
