nxp-mcuxpresso/mcux-soc-svd/MCXW727D/MCXW727D_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOD</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0xA91C6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x128</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2010001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>feature0</name>
                  <description>Basic implementation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>feature1</name>
                  <description>Protection registers implemented</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQNUM</name>
              <description>Interrupt Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Lock</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCNS</name>
              <description>Lock PCNS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pcns0</name>
                  <description>Writable in Secure-Privilege state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcns1</name>
                  <description>Not writable until the next reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICNS</name>
              <description>Lock ICNS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>icns0</name>
                  <description>Writable in Secure-Privilege state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>icns1</name>
                  <description>Not writable until the next reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCNP</name>
              <description>Lock PCNP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pcnp0</name>
                  <description>Writable in Secure-Privilege state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcnp1</name>
                  <description>Not writable until the next reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICNP</name>
              <description>Lock ICNP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>icnp0</name>
                  <description>Writable in Secure-Privilege state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>icnp1</name>
                  <description>Not writable until the next reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNS</name>
          <description>Pin Control Nonsecure</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSE0</name>
              <description>Nonsecure Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE1</name>
              <description>Nonsecure Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE2</name>
              <description>Nonsecure Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE3</name>
              <description>Nonsecure Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE4</name>
              <description>Nonsecure Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE5</name>
              <description>Nonsecure Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE6</name>
              <description>Nonsecure Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE7</name>
              <description>Nonsecure Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE8</name>
              <description>Nonsecure Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE9</name>
              <description>Nonsecure Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE10</name>
              <description>Nonsecure Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE11</name>
              <description>Nonsecure Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE12</name>
              <description>Nonsecure Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE13</name>
              <description>Nonsecure Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE14</name>
              <description>Nonsecure Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE15</name>
              <description>Nonsecure Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE16</name>
              <description>Nonsecure Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE17</name>
              <description>Nonsecure Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE18</name>
              <description>Nonsecure Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE19</name>
              <description>Nonsecure Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE20</name>
              <description>Nonsecure Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE21</name>
              <description>Nonsecure Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE22</name>
              <description>Nonsecure Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE23</name>
              <description>Nonsecure Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE24</name>
              <description>Nonsecure Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
