nxp-mcuxpresso/mcux-soc-svd/MCXW727D/MCXW727D_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ATX0</name>
      <description>Analog Test Annex</description>
      <groupName>ATX</groupName>
      <baseAddress>0xA91CB000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>ATX Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>FEATURE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>MINOR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>MAJOR</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>ATX Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>TEST_UNLOCK</name>
          <description>TEST_UNLOCK register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEST_UNLOCK</name>
              <description>Lock the read/write into test register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEST_UNLOCK_0</name>
                  <description>lock read/write into test register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_UNLOCK_1</name>
                  <description>unlock read/write into test register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST_UNLOCK_VALUE</name>
              <description>Write value that is used to unlock the read/write to test registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>15</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>ATX Control Regs</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDAC_DATA</name>
              <description>7-bit control word for IDAC input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDAC_DATA_0</name>
                  <description>default value, output 0.5ua</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDAC_DATA_1</name>
                  <description>max 1ua</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDAC_DATA_127</name>
                  <description>max 64ua</description>
                  <value>0x7F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDAC_BUS_SEL</name>
              <description>Test bus selection for IDAC current output,this bits only valid when IDAC_EN is set to 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDAC_BUS_SEL_0</name>
                  <description>select test bus 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAC_BUS_SEL_1</name>
                  <description>select test bus 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAC_BUS_SEL_2</name>
                  <description>select test bus 2, In this mode,idac_code_lv is restricted within 7'b0000000 to 7'b0000011 and the output current of IDAC is restricted within 0.5uA to 2uA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAC_BUS_SEL_3</name>
                  <description>Enabled but no test bus is selected.This is forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDAC_EN</name>
              <description>This bit is used to enable IDAC</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDAC_EN_0</name>
                  <description>IDAC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDAC_EN_1</name>
                  <description>IDAC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2V_BUS_SEL</name>
              <description>Test bus selection for I2V voltage output, these 2 bits is only effective when i2v_en_lv is set to &quot;1&quot;</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2V_BUS_SEL_0</name>
                  <description>default value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2V_BUS_SEL_1</name>
                  <description>forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2V_BUS_SEL_2</name>
                  <description>forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2V_BUS_SEL_3</name>
                  <description>select test bus 2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2V_EN</name>
              <description>current to voltage converter enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2V_EN_0</name>
                  <description>current to voltage converter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2V_EN_1</name>
                  <description>current to voltage converter enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2V_25K_ITYPE</name>
              <description>I2V resistor connection selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2V_25K_ITYPE_0</name>
                  <description>default value,connect i2v resistor to ground</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2V_25K_ITYPE_1</name>
                  <description>connect i2v resistor to power</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATX_EN</name>
              <description>no description available</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP_CTRL</name>
          <description>ATX Cmp Control Regs</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ATX_TO_CH6_EN</name>
              <description>Channel 6 of CMP connect to ATX switch control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATX_TO_PAD_CH0P_EN</name>
              <description>PAD and channel 0 of CMP connect to ATX switch control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATX_TO_DAC8B_CH7_EN</name>
              <description>dac8b and channel 7 of CMP connect to ATX switch control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVM_CTRL</name>
          <description>select NVM test channels connecting to ATX buses</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASH_TO_ATX_EN_LV</name>
              <description>This 8-bit signal is used to select NVM test channels connect to ATX bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_0</name>
                  <description>no connection</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_1</name>
                  <description>flash_to_atx_tm_nvm_3v[0] connect to ipt_test_ana_atx3v[0]; no connection on ipt_test_ana_atx3v[1]</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_2</name>
                  <description>flash_to_atx_tm_nvm_3v[1] connect to ipt_test_ana_atx3v[0]; no connection on ipt_test_ana_atx3v[1]</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_4</name>
                  <description>flash_to_atx_tm_nvm_3v[2] connect to ipt_test_ana_atx3v[0]; no connection on ipt_test_ana_atx3v[1]</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_8</name>
                  <description>flash_to_atx_tm_nvm_3v[3] connect to ipt_test_ana_atx3v[0]; no connection on ipt_test_ana_atx3v[1]</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_16</name>
                  <description>no connection to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[0] on ipt_test_ana_atx3v[1]</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_18</name>
                  <description>flash_to_atx_tm_nvm_3v[1] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[0] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_20</name>
                  <description>flash_to_atx_tm_nvm_3v[2] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[0] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_24</name>
                  <description>flash_to_atx_tm_nvm_3v[3] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[0] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_32</name>
                  <description>no connection to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[1] on ipt_test_ana_atx3v[1]</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_33</name>
                  <description>flash_to_atx_tm_nvm_3v[0] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[1] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_36</name>
                  <description>flash_to_atx_tm_nvm_3v[2] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[1] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_40</name>
                  <description>flash_to_atx_tm_nvm_3v[3] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[1] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_64</name>
                  <description>no connection to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[2] on ipt_test_ana_atx3v[1]</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_65</name>
                  <description>flash_to_atx_tm_nvm_3v[0] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[2] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_66</name>
                  <description>flash_to_atx_tm_nvm_3v[1] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[2] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_72</name>
                  <description>flash_to_atx_tm_nvm_3v[3] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[2] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_128</name>
                  <description>no connection to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[3] on ipt_test_ana_atx3v[1]</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_129</name>
                  <description>flash_to_atx_tm_nvm_3v[0] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[3] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_130</name>
                  <description>flash_to_atx_tm_nvm_3v[1] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[3] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x82</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_TO_ATX_EN_LV_132</name>
                  <description>flash_to_atx_tm_nvm_3v[2] connect to ipt_test_ana_atx3v[0]; flash_to_atx_tm_nvm_3v[3] connect to ipt_test_ana_atx3v[1]</description>
                  <value>0x84</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRACK_DETECT_TRANSMIT_L</name>
          <description>Crack Detect Transmit Low</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRACK_DETECT_TRANSMIT_L</name>
              <description>Crack Detect transmit register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRACK_DETECT_RECEIVE_L</name>
          <description>Crack Detect Receive Low</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRACK_DETECT_RECEIVE_L</name>
              <description>Crack Detect receive register Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
